// --створити масив з:
//     - з 5 числових значень
let numbers = [1, 2, 3, 4, 5];
// - з 5 стічкових значень
let string_data1 = ['one', 'two', 'three', 'four', 'five'];
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
let string_data2 = ['one', true, false, true, 'two'];
console.log(numbers, string_data1, string_data2);
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до
// конкретного індексу. Вивести в консоль
let arr1 = [];
arr1[0] = 1;
arr1[1] = 'world';
arr1[2] = true;
console.log(arr1);

// - є масив
let arr2 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// 1. перебрати його циклом while
let i = 0;
while (i < arr2.length) {
    console.log(arr2[i]);
    i++
}
console.log('_________________________________');
//     2. перебрати його циклом for
for (const number of arr2) {
    console.log(number);
}
console.log('_________________________________');
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
i = 0;
while (i < arr2.length) {
    if (i % 2 !== 0) {
        console.log(arr2[i]);
    }
    i++;
}
console.log('_________________________________');
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
for (let j = 0; j < arr2.length; j++) {
    const arr2Element = arr2[j];
    if (j % 2 !== 0) {
        console.log(arr2[j]);
    }
}
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
